Reports/ПродажиИРезервы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ПродажиИРезервы</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ПродажиИРезервы/Ext/ObjectModule.bsl
Функция ПолучитьТаблицуРезервов(ДатаКон)
	
	ТипЦенМелкийОпт = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000014");
	ТипКомплект     = Перечисления.ТипыНоменклатуры.Комплект;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Организация КАК Организация,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Контрагент КАК Контрагент,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Контрагент.Регион КАК Регион,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТоварыВРезервеНаСкладахОстатки.НК КАК НК,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ТипЦен КАК ТипЦен,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Дата КАК Дата,
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК Единица,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ВалютаДокумента КАК Валюта,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.КурсВзаиморасчетов КАК Курс,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.КратностьВзаиморасчетов КАК Кратность,
		|	0 КАК Сумма,
		|	0 КАК СуммаБезСкидок,
		|	0 КАК СуммаСкидки
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаКон, ДокументРезерва <> НЕОПРЕДЕЛЕНО) КАК ТоварыВРезервеНаСкладахОстатки
		|ГДЕ
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток > 0";
	
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	ТЗРезервы = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из ТЗРезервы Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.НК) Тогда
			
			НайденныеСтроки = СтрокаТЗ.ЗаказПокупателя.Товары.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры", СтрокаТЗ.НК));
			
		Иначе
			
			НайденныеСтроки = СтрокаТЗ.ЗаказПокупателя.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТЗ.Номенклатура, СтрокаТЗ.ХарактеристикаНоменклатуры));
			
		КонецЕсли;
		
		ТипЦен = СтрокаТЗ.ТипЦен;
		Скидка = 0;
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Если ТипЦен.Код = "000000001" И
				 НайденныеСтроки[0].Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> ТипКомплект Тогда
				
				ТипЦен = ТипЦенМелкийОпт;
				
			КонецЕсли;
			
			Скидка = НайденныеСтроки[0].ПроцентСкидкиНаценки + НайденныеСтроки[0].ПроцентАвтоматическихСкидок;
			
		КонецЕсли;
		
		ЦенаБС = Ценообразование.ПолучитьЦенуНоменклатуры(
														  СтрокаТЗ.Номенклатура,
														  СтрокаТЗ.ХарактеристикаНоменклатуры,
														  ТипЦен,
														  СтрокаТЗ.Дата,
														  СтрокаТЗ.Единица,
														  СтрокаТЗ.Валюта,
														  СтрокаТЗ.Курс,
														  СтрокаТЗ.Кратность,
														  ,
														  СтрокаТЗ.ДоговорКонтрагента);
		
		СтрокаТЗ.СуммаБезСкидок = СтрокаТЗ.Количество * ЦенаБС;
		СтрокаТЗ.СуммаСкидки    = СтрокаТЗ.СуммаБезСкидок * Скидка / 100;
		СтрокаТЗ.Сумма          = СтрокаТЗ.СуммаБезСкидок - СтрокаТЗ.СуммаСкидки;
		
	КонецЦикла;
	
	Возврат ТЗРезервы;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Период1 = Настройки.ПараметрыДанных.Элементы.Найти("Период1").Значение;
	Период2 = Настройки.ПараметрыДанных.Элементы.Найти("Период2").Значение;
	Период3 = Настройки.ПараметрыДанных.Элементы.Найти("Период3").Значение;
	Период4 = Настройки.ПараметрыДанных.Элементы.Найти("Период4").Значение;
	Режим   = Настройки.ПараметрыДанных.Элементы.Найти("Режим").Значение;
	
	Если Режим = 1 Или Режим = 2 Тогда
		
		ТЗРезервы1 = ПолучитьТаблицуРезервов(Период1.ДатаОкончания);
		ТЗРезервы2 = ПолучитьТаблицуРезервов(Период2.ДатаОкончания);
		ТЗРезервы3 = ПолучитьТаблицуРезервов(Период3.ДатаОкончания);
		ТЗРезервы4 = ПолучитьТаблицуРезервов(Период4.ДатаОкончания);
		
	Иначе
		
		ТЗРезервы1 = Новый ТаблицаЗначений;
		
		ТЗРезервы1.Колонки.Добавить("ЗаказПокупателя"           , Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
		ТЗРезервы1.Колонки.Добавить("Организация"               , Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ТЗРезервы1.Колонки.Добавить("Контрагент"                , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		ТЗРезервы1.Колонки.Добавить("Регион"                    , Новый ОписаниеТипов("СправочникСсылка.Регионы"));
		ТЗРезервы1.Колонки.Добавить("ДоговорКонтрагента"        , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
		ТЗРезервы1.Колонки.Добавить("Номенклатура"              , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗРезервы1.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТЗРезервы1.Колонки.Добавить("Количество"                , Новый ОписаниеТипов("Число"));
		ТЗРезервы1.Колонки.Добавить("Сумма"                     , Новый ОписаниеТипов("Число"));
		ТЗРезервы1.Колонки.Добавить("СуммаБезСкидок"            , Новый ОписаниеТипов("Число"));
		ТЗРезервы1.Колонки.Добавить("СуммаСкидки"               , Новый ОписаниеТипов("Число"));
		
		ТЗРезервы2 = ТЗРезервы1.Скопировать();
		ТЗРезервы3 = ТЗРезервы1.Скопировать();
		ТЗРезервы4 = ТЗРезервы1.Скопировать();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Резервы1.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Резервы1.Организация КАК Организация,
		|	Резервы1.Контрагент КАК Контрагент,
		|	Резервы1.Регион КАК Регион,
		|	Резервы1.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Резервы1.Номенклатура КАК Номенклатура,
		|	Резервы1.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Резервы1.Количество КАК Количество,
		|	Резервы1.Сумма КАК Сумма,
		|	Резервы1.СуммаБезСкидок КАК СуммаБезСкидок,
		|	Резервы1.СуммаСкидки КАК СуммаСкидки
		|ПОМЕСТИТЬ ВТРезервы1
		|ИЗ
		|	&Резервы1 КАК Резервы1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Резервы2.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Резервы2.Организация КАК Организация,
		|	Резервы2.Контрагент КАК Контрагент,
		|	Резервы2.Регион КАК Регион,
		|	Резервы2.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Резервы2.Номенклатура КАК Номенклатура,
		|	Резервы2.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Резервы2.Количество КАК Количество,
		|	Резервы2.Сумма КАК Сумма,
		|	Резервы2.СуммаБезСкидок КАК СуммаБезСкидок,
		|	Резервы2.СуммаСкидки КАК СуммаСкидки
		|ПОМЕСТИТЬ ВТРезервы2
		|ИЗ
		|	&Резервы2 КАК Резервы2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Резервы3.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Резервы3.Организация КАК Организация,
		|	Резервы3.Контрагент КАК Контрагент,
		|	Резервы3.Регион КАК Регион,
		|	Резервы3.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Резервы3.Номенклатура КАК Номенклатура,
		|	Резервы3.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Резервы3.Количество КАК Количество,
		|	Резервы3.Сумма КАК Сумма,
		|	Резервы3.СуммаБезСкидок КАК СуммаБезСкидок,
		|	Резервы3.СуммаСкидки КАК СуммаСкидки
		|ПОМЕСТИТЬ ВТРезервы3
		|ИЗ
		|	&Резервы3 КАК Резервы3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Резервы4.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Резервы4.Организация КАК Организация,
		|	Резервы4.Контрагент КАК Контрагент,
		|	Резервы4.Регион КАК Регион,
		|	Резервы4.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Резервы4.Номенклатура КАК Номенклатура,
		|	Резервы4.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Резервы4.Количество КАК Количество,
		|	Резервы4.Сумма КАК Сумма,
		|	Резервы4.СуммаБезСкидок КАК СуммаБезСкидок,
		|	Резервы4.СуммаСкидки КАК СуммаСкидки
		|ПОМЕСТИТЬ ВТРезервы4
		|ИЗ
		|	&Резервы4 КАК Резервы4
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ПродажиОбороты.Регистратор КАК Регистратор,
		|	ПродажиОбороты.Организация КАК Организация,
		|	ПродажиОбороты.Контрагент КАК Контрагент,
		|	ПродажиОбороты.Контрагент.Регион КАК Регион,
		|	ПродажиОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПродажиОбороты.КоличествоОборот КАК Количество1,
		|	ПродажиОбороты.СтоимостьОборот КАК Сумма1,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот КАК СуммаБезСкидок1,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот - ПродажиОбороты.СтоимостьОборот КАК СуммаСкидки1,
		|	0 КАК Количество2,
		|	0 КАК Сумма2,
		|	0 КАК СуммаБезСкидок2,
		|	0 КАК СуммаСкидки2,
		|	0 КАК Количество3,
		|	0 КАК Сумма3,
		|	0 КАК СуммаБезСкидок3,
		|	0 КАК СуммаСкидки3,
		|	0 КАК Количество4,
		|	0 КАК Сумма4,
		|	0 КАК СуммаБезСкидок4,
		|	0 КАК СуммаСкидки4
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНач1, &ДатаКон1, Авто, ) КАК ПродажиОбороты
		|ГДЕ
		|	(ПродажиОбороты.КоличествоОборот <> 0
		|			ИЛИ ПродажиОбороты.СтоимостьОборот <> 0)
		|	И (&Режим = 0
		|			ИЛИ &Режим = 2)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТРезервы1.ЗаказПокупателя,
		|	ВТРезервы1.ЗаказПокупателя,
		|	ВТРезервы1.Организация,
		|	ВТРезервы1.Контрагент,
		|	ВТРезервы1.Регион,
		|	ВТРезервы1.ДоговорКонтрагента,
		|	ВТРезервы1.Номенклатура,
		|	ВТРезервы1.ХарактеристикаНоменклатуры,
		|	ВТРезервы1.Количество,
		|	ВТРезервы1.Сумма,
		|	ВТРезервы1.СуммаБезСкидок,
		|	ВТРезервы1.СуммаСкидки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	ВТРезервы1 КАК ВТРезервы1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ПродажиОбороты.Регистратор,
		|	ПродажиОбороты.Организация,
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.Контрагент.Регион,
		|	ПродажиОбороты.ДоговорКонтрагента,
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ХарактеристикаНоменклатуры,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ПродажиОбороты.КоличествоОборот,
		|	ПродажиОбороты.СтоимостьОборот,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот - ПродажиОбороты.СтоимостьОборот,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНач2, &ДатаКон2, Авто, ) КАК ПродажиОбороты
		|ГДЕ
		|	(ПродажиОбороты.КоличествоОборот <> 0
		|			ИЛИ ПродажиОбороты.СтоимостьОборот <> 0)
		|	И (&Режим = 0
		|			ИЛИ &Режим = 2)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТРезервы2.ЗаказПокупателя,
		|	ВТРезервы2.ЗаказПокупателя,
		|	ВТРезервы2.Организация,
		|	ВТРезервы2.Контрагент,
		|	ВТРезервы2.Регион,
		|	ВТРезервы2.ДоговорКонтрагента,
		|	ВТРезервы2.Номенклатура,
		|	ВТРезервы2.ХарактеристикаНоменклатуры,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВТРезервы2.Количество,
		|	ВТРезервы2.Сумма,
		|	ВТРезервы2.СуммаБезСкидок,
		|	ВТРезервы2.СуммаСкидки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	ВТРезервы2 КАК ВТРезервы2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ПродажиОбороты.Регистратор,
		|	ПродажиОбороты.Организация,
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.Контрагент.Регион,
		|	ПродажиОбороты.ДоговорКонтрагента,
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ХарактеристикаНоменклатуры,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ПродажиОбороты.КоличествоОборот,
		|	ПродажиОбороты.СтоимостьОборот,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот - ПродажиОбороты.СтоимостьОборот,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНач3, &ДатаКон3, Авто, ) КАК ПродажиОбороты
		|ГДЕ
		|	(ПродажиОбороты.КоличествоОборот <> 0
		|			ИЛИ ПродажиОбороты.СтоимостьОборот <> 0)
		|	И (&Режим = 0
		|			ИЛИ &Режим = 2)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТРезервы3.ЗаказПокупателя,
		|	ВТРезервы3.ЗаказПокупателя,
		|	ВТРезервы3.Организация,
		|	ВТРезервы3.Контрагент,
		|	ВТРезервы3.Регион,
		|	ВТРезервы3.ДоговорКонтрагента,
		|	ВТРезервы3.Номенклатура,
		|	ВТРезервы3.ХарактеристикаНоменклатуры,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВТРезервы3.Количество,
		|	ВТРезервы3.Сумма,
		|	ВТРезервы3.СуммаБезСкидок,
		|	ВТРезервы3.СуммаСкидки,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	ВТРезервы3 КАК ВТРезервы3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ПродажиОбороты.Регистратор,
		|	ПродажиОбороты.Организация,
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.Контрагент.Регион,
		|	ПродажиОбороты.ДоговорКонтрагента,
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ХарактеристикаНоменклатуры,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ПродажиОбороты.КоличествоОборот,
		|	ПродажиОбороты.СтоимостьОборот,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот - ПродажиОбороты.СтоимостьОборот
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНач4, &ДатаКон4, Авто, ) КАК ПродажиОбороты
		|ГДЕ
		|	(ПродажиОбороты.КоличествоОборот <> 0
		|			ИЛИ ПродажиОбороты.СтоимостьОборот <> 0)
		|	И (&Режим = 0
		|			ИЛИ &Режим = 2)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТРезервы4.ЗаказПокупателя,
		|	ВТРезервы4.ЗаказПокупателя,
		|	ВТРезервы4.Организация,
		|	ВТРезервы4.Контрагент,
		|	ВТРезервы4.Регион,
		|	ВТРезервы4.ДоговорКонтрагента,
		|	ВТРезервы4.Номенклатура,
		|	ВТРезервы4.ХарактеристикаНоменклатуры,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВТРезервы4.Количество,
		|	ВТРезервы4.Сумма,
		|	ВТРезервы4.СуммаБезСкидок,
		|	ВТРезервы4.СуммаСкидки
		|ИЗ
		|	ВТРезервы4 КАК ВТРезервы4";
	
	
	Запрос.УстановитьПараметр("Резервы1", ТЗРезервы1);
	Запрос.УстановитьПараметр("Резервы2", ТЗРезервы2);
	Запрос.УстановитьПараметр("Резервы3", ТЗРезервы3);
	Запрос.УстановитьПараметр("Резервы4", ТЗРезервы4);
	Запрос.УстановитьПараметр("ДатаНач1", Период1.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон1", Период1.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНач2", Период2.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон2", Период2.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНач3", Период3.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон3", Период3.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНач4", Период4.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон4", Период4.ДатаОкончания);
	Запрос.УстановитьПараметр("Режим"   , Режим);
	
	ТЗПродажиИРезервы = Запрос.Выполнить().Выгрузить();
	
	ВнешниеНаборыДанных = Новый Структура;
	
	ВнешниеНаборыДанных.Вставить("ПродажиИРезервы", ТЗПродажиИРезервы);
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	//ДокументРезультат.ФиксацияСлева = 2;
	
КонецПроцедуры
